#使用前确保安装gmpy2及Crypto
import gmpy2
from Crypto.Util.number import long_to_bytes

#填写C、e、N以及通过分解N得出p、q
c=                          # c = 28767758880940662779934612526152562406674613203406706867456395986985664083182
e=                          # e = 65537
p=                          # p = 386123125371923651191219869811293586459
q=                          # q = 189239861511125143212536989589123569301
n=                          # n = 73069886771625642807435783661014062604264768481735145873508846925735521695159

n = q * p
# print(n)     ##验证n的计算是否正确
d = gmpy2.invert(e, (p - 1) * (q - 1))
print("d=", d)
m = pow(c, d, n)
print(m)
print(long_to_bytes(m))